// შესავალი TypeScriptში
// ბრაუზერები ტაიპსკრიპტს არ კითხულობენ, ამიტომ ჯავასკრიპტში ნათარგმნ კოდს ვაწვდით
// თარგმნა ხდება compiler-ით. ტაიპსკრიპტს რო დააყენებ მოყვება
// typescript არის ჯავასკრიპტის ფექიჯი, npm იდან უნდა ჩავიწეროთ
// npm install -g typescript გავუშვი და დაინსტალირდა
// npm i -g typescript გავუშვი და გადაითარგმნა
// typescript ში ცვლადებს აქვთ ინფორმაციის ტიპი. თუ ნამბერიარის ცვლადი, იქ სტრინგს ვერ ჩაწერ

// ცვლადის აღწერისას შეგიძლია მიუთითო ინფორმაციის ტიპი :number ასე

let x:number = 10;
// მარა აქ x ში არარის საჭირო :number-ის ჩაწერა, რიცხვს რადგან უთითებ ეგრევე ხვდება რო რიცხვია
// ანუ აი აქ x ში სტრინგი რო ჩაწერო ერორს მოგცემს
// შეგილია ჯერ ცვლადს განუსაზღვრო ინფორმაციული ტიპი, მარა ინფო ჯერ არ შეინახო

let y:boolean;
y= true;

// ტაიპსკრიპტი აქტიურად გამოიყენება  ფუნქციებშიც
function add (num1:number,num2:number) {
    return num1+num2
}

let added = add('4','5'); 
//რადგან სტრინგად გადავეცი ინფორმაცია დააერორა. რომ არ მიმეთითებინა :number დაწერდა 45ს

// შეგვილია რო აღარ დაარტყას ერორი სტრინგეებს წინ + ნიშანი მივუწეროთ და რიცხვის ტიპის ინფოდ გარდაქმნის
 let summed = add(+'4',+'6')
 // შეკრიბავს და 10ს დააბრუნებს

 

 // Object types

 const Mentor = {
    name: 'Sofi',
    surname: 'siradze'
 }
 Mentor.name = 'Lika' // ინფორმაცია შევცვალე ცვლადში
 // რამე ინფოს დამატება რო მინდოდეს მაგას ვერ ვიზამ. ამიტომ უნდა ჩავწერო ობიექტის განმარტებები

 const mentor:{
    saxeli:string;
    gvari:string;
    asaki?:number // კითხვის ნიშანი აკეთებს რო ასაკი შეილება ყველას არქონდესო ანუ optional
 }= {
    saxeli: 'sofia',
    gvari: 'siradze'
 }
mentor.asaki = 55; // ერორს აღარ არტყამს

// როგორ მოვიქცე თუ ყოველ ჯერზე არმინდა mentor ობიექტის აღწერა მის გამოყენებისას?
// უნდა შევქმნათ მაგ ობიექტის type 
type mentori={
    saxeli:string;
    gvari:string;
    asaki?:number
 }

 // და შემილია კონკრეტულ ობიექტს ეგ ტიპი გავუწერო

 const bostneuli:mentori = {
    saxeli:'stafilo',
    gvari:'stafilovichi'
 }
bostneuli.asaki = 99;
// და ბოსტნეულის ასაკში შემილია ინფორმაციის დამატება


// ARRAY TYPES

// number array ში სტრინგს ვერ ჩავpush ავთ
const array = [44, 55, 66]
array.push('hi')
// error დაარტყა

// შეგვილია ცარიელი ერეი შევქმნათ და თაიფი მივუთითოთ

//const allNumbers:number[] = []
// :number[] მ გამოიწვია ის, რომ ერეი ინფორმაციად მარტო რიცხვებს მიიღებს
//allNumbers.push(55) //  ჩაიფუშება მარა "55" არა


// თუ ერეიში სხვადასხვა ტიპის ინფორმაციის შეტანა გვინდა, მაშინ ესე უნდა ვქნათ

const gmirebi: any[]=[];
gmirebi.push(55);

// any ფაქტობრივად თიშავს ტაიპსკრიპტს


