// NPM არის node package manager დეველოპერების ეფსთორისავითაა, აქედან შეძლებენ ჩამოწერონ მზა ფაილები
// npm innit -ის დახმარებით ხდება ფექიჯის ინიცირება
// და ფოლდერსი იხოდება package ფაქტობრივად
// entry point ინიცირებაში არის შენი ფექიჯის მთავარი ჯავასკრიპტ ფაილი

// რო შევქმენი ინიციატივა ჩაემატა მთავარ ვებ ფოლდერში ფაილი: package.json
// რა არის ჯეისონ ფაილი?
// javascript object notation
// json არის ჯავასკრიპტის ობიექტის ტექსტური ვერსია
// ეს ჯეისონ ფაილი ჩაინიშნავს ყველაფერს, რომელი ფექიჯები გაქ ჩაწერილი ამ ფაილში, რა ინფორმაციას ინაცავს ვებსაიტი და ა.შ
// import

import isOdd from "is-odd";
console.log(isOdd('3456'));

// error  დაარტყა, იმიტომ რომ მოდულარული ფაილი არ არის. ეს რომ მოვაგვაროთ
// package.json ში უნდა ჩავამატოთ "type": "module"
// package.json ის ფაილში და სხვა ფექიჯების ფაილშიც სულ გვაქვს მოცემული dependencies სია, რომელზეც არის დამოკიდებული ეს კონკრეტული ფაილი
// პროექტიდან ფექიჯი რომ წავშალოთ უნდა ავკრიფოთ mpn uninstall 
// npm ls - ნახავ დაყენებულ ფექიჯებს
// npm outdated - ნახავ ვადაგასულ ფექიჯებს
// npm install ცალკე თუ გაუშვებ, ფექიჯს თუ არ მოაყოლებ,  დეფენდენსიებს გადააინსტალირებს
// npm update - ახალ ვერსიებს დაგიინსტალირებს
// node module-ებს გითჰაბზე არ ვტვირთავთ. თუ გითჰაბიდან ჩავიწერთ კოდს, node  npm install გავუშვებთ, და თავისიტ დაყენდება
